#    -*- mode: org -*-


Archived entries from file /home/alexis/org/auragen.org


* DONE Vérifier interêt STR multiples non rendus
CLOSED: [2024-07-08 lun. 10:09] SCHEDULED: <2024-07-08 lun.>
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-24 Wed 14:02
:ARCHIVE_FILE: ~/org/auragen.org
:ARCHIVE_OLPATH: Divers
:ARCHIVE_CATEGORY: auragen
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-07-08 lun. 09:53]--[2024-07-08 lun. 10:09] =>  0:16
:END:
  /Entered on/  [2024-07-08 lun. 09:03]

* DONE Nettoyer tâches finies dans "améliorations" et "questions" :doc:
CLOSED: [2024-06-11 mar. 10:44] SCHEDULED: <2024-06-11 mar.>
:PROPERTIES:
:ARCHIVE_TIME: 2024-07-24 Wed 14:02
:ARCHIVE_FILE: ~/org/auragen.org
:ARCHIVE_OLPATH: Divers
:ARCHIVE_CATEGORY: auragen
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-06-11 mar. 10:42]--[2024-06-11 mar. 10:44] =>  0:02
:END:
  /Entered on/  [2024-06-11 mar. 10:26]

* DONE Regarder variants non vus "en aveugle" [15/15]
CLOSED: [2024-06-26 mer. 15:01] SCHEDULED: <2024-06-26 mer.>
:PROPERTIES:
:ARCHIVE_TIME: 2024-08-26 lun. 17:42
:ARCHIVE_FILE: ~/org/auragen.org
:ARCHIVE_OLPATH: Curagen2
:ARCHIVE_CATEGORY: curagenv2
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-06-11 mar. 11:27]--[2024-06-11 mar. 12:38] =>  1:11
CLOCK: [2024-06-10 lun. 14:37]--[2024-06-10 lun. 15:01] =>  0:24
CLOCK: [2024-05-27 lun. 16:43]--[2024-05-27 lun. 17:15] =>  0:32
CLOCK: [2024-05-27 lun. 13:51]--[2024-05-27 lun. 16:00] =>  2:47
CLOCK: [2024-05-27 lun. 10:47]--[2024-05-27 lun. 11:51] =>  1:04
:END:
** DONE MR-2203533 seqone échec
DEADLINE: <2024-07-02 mar.> SCHEDULED: <2024-06-25 mar.>
:LOGBOOK:
CLOCK: [2024-07-01 lun. 15:02]--[2024-07-01 lun. 15:03] =>  0:01
:END:
* WAIT 15 variants
:PROPERTIES:
:LAST_REPEAT: [2024-07-18 Thu 11:16]
:ARCHIVE_TIME: 2024-08-27 mar. 16:40
:ARCHIVE_FILE: ~/org/auragen.org
:ARCHIVE_OLPATH: Variants interprétés
:ARCHIVE_CATEGORY: excel
:ARCHIVE_TODO: WAIT
:END:
- State "DONE"       from "TODO"       [2024-07-18 Thu 11:16]
- State "DONE"       from "TODO"       [2024-07-17 mer. 11:15]
- State "DONE"       from "TODO"       [2024-07-16 mar. 11:15]
- State "DONE"       from "TODO"       [2024-07-09 mar. 11:00]
- State "DONE"       from "TODO"       [2024-07-08 lun. 16:12]
:LOGBOOK:
CLOCK: [2024-07-09 mar. 08:45]--[2024-07-09 mar. 11:00] =>  2:15
CLOCK: [2024-07-08 lun. 15:54]--[2024-07-08 lun. 16:12] =>  0:18
CLOCK: [2024-07-08 lun. 09:05]--[2024-07-08 lun. 09:41] =>  0:36
:END:
- State "DONE"       from "TODO"       [2024-07-01 lun. 15:02]
- State "DONE"       from "TODO"       [2024-06-27 jeu. 14:39]
- State "DONE"       from "TODO"       [2024-06-25 mar. 10:55]
- State "DONE"       from "TODO"       [2024-06-24 lun. 16:57]
  /Entered on/  [2024-06-24 lun. 16:20]

*** DONE Script python pour downgrade noms de gènes
CLOSED: [2024-06-11 mar. 10:34] SCHEDULED: <2024-06-17 lun.> DEADLINE: <2024-08-01 jeu.>
:LOGBOOK:
CLOCK: [2024-05-31 ven. 09:37]--[2024-05-31 ven. 10:00] =>  0:23
:END:
envoyé quentin
  /Entered on/  [2024-05-27 lun. 13:38]
*** DONE MR-2304637 Remplir CR hygen
CLOSED: [2024-07-11 jeu. 10:05] SCHEDULED: <2024-07-11 jeu.>
:LOGBOOK:
CLOCK: [2024-07-08 lun. 10:19]--[2024-07-08 lun. 11:04] =>  0:45
:END:
Le séquençage du génome du patient en duo n'a pas permis d'identifier de variant clairement pathogène pouvant expliquer le phénotype de la patiente.

Cependant, une variation hétérozygote faux-sens de signification incertaine dans l'exon 13 du gène CACNA1C a été identifiée.NM_000719.7:c.1736G>A p.(Gly579Asp). Cette variation est héritée de la mère dans un génome en duo. Cette variation est absente de la base de données populationnelles gnomAD v4.0. Les différents scores de prédiction bio-informatique appliqués soutiennent un impact fonctionnel.Elle n'est pas dans un domaine fonctionnel mais l'acide aminé est très conservé.

Le gain de fonction du gène CACNA1C est lié à un allongement du QT chez quasiment tous-les patients avant l'âge de 4 ans, ainsi que de manière fréquente à un trouble du spectre autistique et parfois des malformations cardiaques et un retard de devéloppement (Napolitano et al, 2006 Genereviews). Cependant, un phénotype extra-cardiaque prédominant a été également décrit avec des trouble du neurodéveloppement (OMIM #620029). Celui-ci comprend une hypotonie, retard de language et déficience intellectuelle avec trouble du comportement. Les atteintes cardiaques sont rares (PMID: 34163037).

L'étude de la ségrégation de cette variation dans la famille avec l'analyse du père et la confrontation aux phénotypes permettraient d'affiner l'interprétation de cette variation. La
confirmation de ce résultat sur un second prélèvement indépendant est recommandée.

*Une consultation de génétique est nécessaire pour expliquer ce résultat.*
*** DONE Écrire formule remaniement MR-2402030
CLOSED: [2024-07-08 lun. 15:54] SCHEDULED: <2024-07-08 lun.>
:LOGBOOK:
CLOCK: [2024-07-08 lun. 13:56]--[2024-07-08 lun. 15:54] =>  1:58
CLOCK: [2024-07-08 lun. 13:39]--[2024-07-08 lun. 13:47] =>  0:08
CLOCK: [2024-07-08 lun. 11:07]--[2024-07-08 lun. 12:07] =>  1:00
:END:
seq[GRCh38]inv(8)(q12.2)inv(8)(q12.2)del(8)(q12.2)dn
NC_000008.11:g.60859596_60862961inv
NC_000008.11:g.60862561_60863010inv
NC_000008.11:g.60862564_60866381del

Présence d'un remaniement complexe en 8q12.2 d'environ 6.7kbp, de novo. Il contient les 3 derniers exons de CHD7. 5 points de cassures ont été identifiés, dont une probable délétion comprenant les deux derniers exons. Il n'est pas possible d'exclure le caractère en mosaïque de cette délétion.

L'haploinsuffisance de CHD7 est associée au syndrome CHARGE (OMIM #214800). Ce remaniement est donc pathogène (classe 5) et explique le phénotype.
Un conseil génétique est souhaitable.

La caractérisation précise de ce variant structurel nécessiterait une technique complémentaire (long-read).

*** DONE [#A] MR-2401702: ARF1 classe 4. Faire CR
CLOSED: [2024-08-26 lun. 14:05] SCHEDULED: <2024-08-26 lun.>
:PROPERTIES:
:EFFORT:   1:00
:END:
:LOGBOOK:
CLOCK: [2024-08-23 ven. 09:30]--[2024-08-23 ven. 11:27] =>  1:57
:END:
  /Entered on/  [2024-08-22 jeu. 17:55]
seqone : vérifier ZFYVE26 VPS50 POMT2 (2e variant mais bof) CTSK AR
